#Напишите функцию, которая принимает на вход строку — абсолютный путь до файла. Функция возвращает кортеж из трёх
#                       элементов: путь, имя файла, расширение файла.
#Напишите однострочный генератор словаря, который принимает на вход три списка одинаковой длины: имена str, ставка int,
#   премия str с указанием процентов вида «10.25%». В результате получаем словарь с именем в качестве ключа и суммой
#   премии в качестве значения. Сумма рассчитывается как ставка умноженная на процент премии
#Создайте функцию генератор чисел Фибоначчи
from Task1.task1 import task1
from Task2.task2 import task2
from Task3.task3 import task3

print("Task1:")
task1()
print("Task2:")
task2()
print("Task3:")
task3()
